Revit 2024 API
UnitFormatUtils.TryParse Method (Units, ForgeTypeId, String, Double, String)
 Parses a formatted string into a number with units if possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool TryParse(
	Units units,
	ForgeTypeId specTypeId,
	string stringToParse,
	out double value,
	out string message
)
Visual Basic
Public Shared Function TryParse ( _
	units As Units, _
	specTypeId As ForgeTypeId, _
	stringToParse As String, _
	<OutAttribute> ByRef value As Double, _
	<OutAttribute> ByRef message As String _
) As Boolean
Visual C++
public:
static bool TryParse(
	Units^ units,
	ForgeTypeId^ specTypeId,
	String^ stringToParse,
	[OutAttribute] double% value,
	[OutAttribute] String^% message
)
Parameters
units
Type: Autodesk.Revit.DB.Units
 The units formatting settings, typically obtained from Document.GetUnits().
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the target spec for the value.
stringToParse
Type: System.String
 The string to parse.
value
Type: System.Double
 The parsed value. Ignore this value if the function returns false.
message
Type: System.String
 A localized message that, if the parsing fails, explains the reason for failure.
Return Value
 True if the string can be parsed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UnitFormatUtils Class
TryParse Overload
Autodesk.Revit.DB Namespace